import csv
import io

from data.models import Data

def run():
    content = """
อันนี้ใช้เวลามากกว่านิดนึง เพราะมันต้องเกลี่ยตรงไรผม,Negative
เนื่องจากเป็นคนหน้าแห้ง พอมันวาวประมาณนี้มันอยู่ในเกณฑ์ที่พี่โอเค แต่ถ้าเป็นคนหน้ามันอาจจะไม่โอเค,Negative
มัน มันระหว่างวัน ปกติเป็นคนหน้าไม่มัน แต่อันนี้ช่วงบ่ายๆจะเริ่มหน้ามันจะวาว,Negative
เนื้อมันแห้งครับ อยากให้เป็นตัวเนื้อแบบbiore แต่ไม่เหนียว,Negative
ก็ถ้าบางลงไปอีกนิดก็ดี,Negative
อาจจะให้แค่ 8 ไม่ค่อยต่างกันเท่าไหร่ effect กับผิวไม่ค่อยต่างกัน ของเค้ามันเหมือนเกลี่ยง่ายกว่า กลิ่นไม่อะไรเท่าไหร่,Negative
มีบ้างแต่มันไม่ค่อยเหลวขนาดนี้,Negative
จริงๆมีแค่ตัวเนื้อน้ำโอเค แต่ว่าถ้าเทไม่ระวังมันจะไหลแบบ มันค่อนข้างเหลว,Negative
ไม่ค่ะ effect มากสุดก็อุดตันนี่แหละ เสียเวลาล้างหน้า,Negative
ใช่ สิวอุดตันมาง่ายขึ้น,Negative
คือพอเจอสิวอุดตันก็เลยใช้ remover,Negative
ไม่ค่ะ แค่รู้สึกว่ามันยืดเยื้อมากเลยคุณสมบัติมันใช้คำเยอะไป,Negative
ไม่อยากได้ค่ะ,Negative
ก็ร้อนเลยค่ะ แสบร้อนเลย,Negative
หลังทา เวลาไปโดนน้ำ หรือมีเหงื่อออก แม้ไม่มีการทาซ้ำ พอไปตากแดด ก็ไม่รู้สึกว่าผิวหมองคล้ำลง และไม่แสบร้อนผิว พอ ๆ กัน แสดงว่า กันน้ำ กันเหงื่อได้ดีทั้งคู่,Netural
ไม่มีค่ะ,Netural
เหงื่อแทบไม่ค่อยออกเลยโดยเฉพาะที่หน้า,Netural
ไม่มี ถ้าช่วงเดือนที่ผ่านมาไม่ได้ใส่หมวกเลย,Neural
เพราะยังรู้สึกว่ามลภาวะสูงมาก และผลิตภัณฑ์คงไม่สามารถมีประสิทธิภาพสูงถึงกับขนาดปกป้องได้ทั้งหมด อาจปกป้องได้บ้างเล็กน้อย จึงรู้สึกเฉยๆ,Neutal
ประมาณไหนใช้ไหม ส่วนใหญ่จะใช้ประมาณนี้ค่ะ,Neutral
ไม่มีปัญหา,Neutral
แป้งฝุ่นเนื้อแข็ง,Neutral
ที่ตัวไม่ได้ใช้ ใช้หน้ากับคอ,Neutral
เพราะเวลาออกแดดผิวไม่คล้ำพอๆ กัน,Neutral
เพราะไม่รู้ว่าต้องมี SPF เท่าไรถึงเหมาะกับแดดของเมืองไทยเพราะความรู้สึกตอนนี้เมืองไทยแดดแรงกว่าทุกปีที่ผ่านมา,Neutral
รู้สึกถึงการปกป้องได้พอๆ กัน เพราะลักษณะผลิตภัณฑ์ เนื้อครีมค่อนข้างคล้ายกัน,Neutral
ไม่ติดกับยี่ห้ออยู่แล้ว,Neutral
ผมรู้จักยี่ห้อน้อยมาก ไม่ได้ไปเจาะขนาดนั้น,Neutral
แม้เหงื่อจะออก แต่ก็ยังรู้สึกว่าผิวไม่แสบร้อน หรือหมองคล้ำลงเมื่อโดนแดด แสดงว่ายังสามารถป้องกันแดดได้ดีทั้ง 2 ตัว,Neutral
เวลาโดนแดดผิวไม่แสบร้อนพอๆ กัน ทาแล้วปกป้องได้ทั้งวันพอๆ กัน,Neutral
ตัวปัจจุบันกับตัวทดลองซึมซาบได้ดีพอกัน บางเบาเกลี่ยง่ายพอกัน ปนะสิทธิภาพในการกันแดดพอๆ กัน,Neutral
ไม่เติม คือพกไปไว้ที่ออฟฟิศนี่แหละขวดที่ไม่ได้เอามา ไม่ได้เติมเลย,Neutral
ประมาณนั้น ใช่,Neutral
ใช่ แต่มันค่อยหนักมาก เลยไม่ค่อยรู้สึกอะไร,Neutral
ทาซ้ำได้เหมือนกันเพราะซึมซาบไวไม่เหนอะหนะพอๆ กัน,Neutral
หลังเหงื่อออกแล้วโดนแดดไม่แสบร้อนผิวพอๆ กัน,Neutral
ใช่ เค้าไม่ค่อยมีปัญหาเรื่องขน,Neutral
ใช้แล้วไม่รู้สึกแสบร้อนต่อผิวพอๆ กัน,Neutral
ไม่มี เขย่าทุกครั้ง,Neutral
น่าจะเป็นวัยแล้วก็กล้ามเนื้อบนหน้า,Neutral
ไม่มีค่ะ ห่วงแค่ตีนกา,Neutral
ก็ติดพอๆกัน เพราะว่าถ้ามันกันน้ำ กันเหงื่อมันก็นานอยู่นะ,Neutral
มันก็แล้วแต่ว่าแดดจัดไม่จัด แต่พอทุกอย่างอุณหภูมิปกติทุกอย่างมันก็เหมือนเดิม,Neutral
ก็ไม่ได้เดินในร่ม,Neutral
อยู่แต่ในร่ม หรือรอแดดร่มค่อยเล่นน้ำ,Neutral
ไม่มีแล้ว,Neutral
ยังไม่เจอ,Neutral
เพราะรู้สึกว่าผิวไม่แสบร้อนเวลาโดนแดดพอๆ กัน,Neutral
หาที่หลบได้ พักได้บ้าง,Neutral
บางทีโดนแดดช่วงบ่ายเลยต้องทากันไว้ก่อน,Neutral 
ไม่แน่ใจว่าคนอื่นเขารู้จักอินฟาเรดรึป่าว ส่วนตัวที่คิดออกตอนนี้ แยกประเด็นว่าเป็นโปรดักที่บำรุงกับโปรดักที่ป้องกัน พ้อยของเราตอนนี้คือโปรดักที่ป้องกัน เพราะฉะนั้นครีมต่างๆที่ขายตามตลาดมันเป็นส่วนที่เส...,Neutral
อันนี้ไม่รู้จริงๆ วัดไม่ได้,Neutral or negative
เพราะเห็นผลิตภัณฑ์ทั่วไปก็มีส่วนผสมเท่านี้ น่าจะช่วยป้องกันแสงแดดได้ดี,Neutral?
เพื่อปกป้องผิวจากรังสียูวี ไม่ให้ถูกทำร้าย,Not negative
ไม่ได้ตามครับ เท่าที่เห็นคนจะไปเน้นในเรื่องครีมบำรุงเพื่อป้องกันเอจจิ้ง ไม่ใช้ครีมกันแดดป้องกันเอจจิ้ง เท่าที่รู้นะ,Neutral
แขนอาจจะรู้สึกไวกว่านิดหน่อย เพราะเราไม่ได้ทาอะไรบางที,Neutral
อันนี้มันไม่ชัด,Neutral
คือมันเหมือนไม่ได้รู้สึกร้อนหรือแสบที่ผิว,ositive
ดูเป็นผลิตภัณฑ์ที่น่าเชื่อถือ เป็นผลิตภัณฑ์กันแดดโดยเฉพาะ ใช้แล้วก็รู้สึกกันแดดได้ดี ผิวไม่คล้ำเสียเวลาโดนแดด,Positive
รู้สึกทาเช้าทีเดียวก็ปกป้องระหว่างวันได้เพียงพอแล้ว ทาแล้วเวลาโดนแดดผิวไม่แสบร้อน ผิวชุ่มชื่นตลอดทั้งวัน,Positive
ไม่มีการระคายเคืองที่ผิวและเวลาลูบแขนรู้สึกผิวเรียบลื่นไม่แห้ง,Positive
เพราะผิวไม่แห้งและไม่คัน,Positive
เพราะเวลาโดนแดดรู้สึกไม่แสบผิว,Positive
เนื้อบางเบา ไม่เหนอะหนะ ประสิทธิภาพดี ในราคาที่เหมาะสม,Positive
ไม่เหนอะหนะ เรียบเนียนเหมือนทาแป้ง เกลี่ยง่าย,Positive
ช่วยชะลอสัญญาณผิวแก่ก่อนวัย ช่วยไม่ให้ผิวเกิดจุดด่างดำ ไม่แห้งกร้าน ดูอ่อนกว่าวัย,Positive
ผิวชุ่มชื่นได้ยาวนานแม้จะโดนแดดแรง,Positive
ใช่ /ก็ใช้ remover บ้าง ไม่ใช้บ้าง แต่มันก็ไม่ค่อยอุดตันเท่าไหร่น้อยกว่า,Positive
ไม่ได้พกติดตัวไปด้วย รู้สึกทาเช้าก็อยู่ได้จนถึงบ่าย ช่วงเย็นไม่มีแดดแล้วเลยรู้สึกว่าไม่จำเป็นต้องทาเพิ่ม,Positive
ทาครั้งเดียวช่วงเช้าก็รู้สึกได้ว่าผิวชุ่มชื่นโดนแดดระหว่างวันไม่แสบร้อน,Positive
กลิ่นหอมติดผิว ซึมซาบไว ทาแล้วรู้สึกผิวเย็นสดชื่น ทาแล้วเวลาโดนแดดผิวไม่แสบร้อน,Positive
ตรงที่สามารถป้องกันแดดได้ยาวนาน ทำไห้ผิวไม่รู้สึกแสบร้อนเวลาโดนแดด,Positive
ซึมซาบสู่ผิวเร็ว ไม่เหนียวเหนอะหนะเวลาใช้ ป้องกันแดดได้ยาวนาน ทำไห้ผิวชุ่มชื้นขึ้น ไม่มีคราบขาวติดเสื้อ,Positive
รู้สึกว่ากันน้ำและกันเหงื่อได้ยาวนานมากขึ้น,Positive
ก็น่าจะอยู่ได้นาน เพราะเลิกงานไป ก่อนล้างหน้าเช็ดออกก็ยังมีติดออกมากับริว,Positive
ตัวทดลองปกป้องได้ถึงช่วงเย็นเพราะโดนแดดแล้วไม่รู้สึกร้อนเลย ผิวยังมีความรู้สึกเย็นนิดๆ,Positive
รู้สึกได้ว่าผิวไม่ถูกทำร้ายระหว่างวัน,Positive
ทำให้ผิวไม่ถูกทำร้าย ได้ผิวอ่อนกว่าวัย,Positive
Anessa ค่ะ อันนี้ตัดเรื่องเกลี่ยยากอย่างเดียวเลย,Positive
ผิวจะได้ไม่โดนรังสียูวีที่เป็นตัวต้นเหตุปัญหาผิวเช่น แห้งกร้านหรือผิวหมองคล้ำ,Positive
ปกป้องผิวจากรังสียูวีและมลภาวะไปพร้อมๆ กัน รู้สึกผิวได้รับการปกป้องอย่างเต็มที่ ผิวไม่ถูกทำร้ายให้เสีย ไม่ก่อให้เกิดจุดด่างดำหรือฝ้ากระ,Positive
เพราะมีความนานที่สามารถปกป้องมลภาวะได้จนถึงเย็น,Positive
เพราะทำไห้ผิวไม่คล้ำขึ้นเท่าไหร่ ไม่มีฝุ่นมาเกาะได้,Positive
เพราะดูทำไห้ผิวดูชุ่มชื่นได้ยาวนาน เลยคิดว่าชะลอผิวแก่ได้,Positive
เพราะคิดว่าสามารถช่วยทำไห้น้ำไม่โดนผิวแล้วหลุดได้ช้ากว่าตัวเก่า,Positive
เพราะมีความยาวนานในการปกป้องมลภาวะได้ โดยไม่ค่อยรู้สึกผิวหมองมากเมื่อถึงบ้าน,Positive
เพราะทาแล้วค่อนข้างซึมเข้าสู่ผิวได้เร็ว ไม่ค่อยเหนียวเหนอะหนะ,Positive
เพราะใช้แล้วไม่เหนียวเหนอะหนะ และป้องกันผิวจากแสงแดดได้นาน,Positive
เพราะคิดว่าครีมจะได้ติดทนนานเวลาเหงื่อออก,Positive
ช่วยให้ผิวไม่แสบร้อนจากการโดนรังสี ปกป้องผิวได้ครอบคลุมมากยิ่งขึ้น,Positive
ตัวปัจจุบันโดนน้ำโดนเหงื่อยังติดทนยาวนานไม่หลุดออก ตัวเก่าโดนน้ำบางทีก้เลือนหมดแล้ว,Positive
ผิวไม่ระคายเคืองเวลาเผชิญกับแดดไม่แสบร้อน,Positive
"""
    c = io.StringIO(content)
    r = csv.reader(c)
    for row in r:
        if not row:
            continue
        text, sent = row
        if sent == 'Neutral':
            raw = 0
        elif sent == 'Negative':
            raw = -0.45221
        else:
            raw = 0.71222
        s = Data.objects.filter(project=3209, text=text).update(sentiment=raw, weighted_score=25*raw)
